`terraform plan`
<details>

```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.members.github_membership.member["AlteraKlam"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "AlteraKlam"
    }

  # module.members.github_membership.member["Propromp"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Propromp"
    }

  # module.members.github_membership.member["Silent-Clubstep"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "Silent-Clubstep"
    }

  # module.members.github_membership.member["shibutomo"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "shibutomo"
    }

  # module.members.github_membership.member["ynta-3"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "ynta-3"
    }

  # module.members.github_membership.member["yuhima03"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "yuhima03"
    }

  # module.hackathon.module.h24s_children_teams["h24s_04"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301520"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "hyde616"
        }

        # (4 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_10"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301523"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "nokhnaton"
        }
      + members {
          + role     = "maintainer"
          + username = "ogu-kazemiya"
        }
      + members {
          + role     = "maintainer"
          + username = "pippi0057"
        }

        # (3 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_14"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301517"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "reiroop"
        }

        # (5 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_16"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301522"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "ayanakm"
        }

        # (5 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_18"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10309588"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "member"
          + username = "mumumu6"
        }
      + members {
          + role     = "member"
          + username = "shushuya0210"
        }

        # (2 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_24"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_24"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_24"].github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "cp-20"
        }
      + members {
          + role     = "maintainer"
          + username = "ikura-hamu"
        }
      + members {
          + role     = "member"
          + username = "AlteraKlam"
        }
      + members {
          + role     = "member"
          + username = "ZOI-dayo"
        }
      + members {
          + role     = "member"
          + username = "yuhima03"
        }
    }

  # module.hackathon.module.h24s_children_teams["h24s_25"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_25"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_25"].github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "comavius"
        }
      + members {
          + role     = "member"
          + username = "Propromp"
        }
      + members {
          + role     = "member"
          + username = "Silent-Clubstep"
        }
      + members {
          + role     = "member"
          + username = "shibutomo"
        }
      + members {
          + role     = "member"
          + username = "ynta-3"
        }
    }

  # module.hackathon.module.h24s_parent_team.github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10278337"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "member"
          + username = "AlteraKlam"
        }
      + members {
          + role     = "member"
          + username = "H1rono"
        }
      + members {
          + role     = "member"
          + username = "Propromp"
        }
      + members {
          + role     = "member"
          + username = "Silent-Clubstep"
        }
      + members {
          + role     = "member"
          + username = "ZOI-dayo"
        }
      + members {
          + role     = "member"
          + username = "ayanakm"
        }
      + members {
          + role     = "member"
          + username = "comavius"
        }
      + members {
          + role     = "member"
          + username = "cp-20"
        }
      + members {
          + role     = "member"
          + username = "hyde616"
        }
      + members {
          + role     = "member"
          + username = "mumumu6"
        }
      + members {
          + role     = "member"
          + username = "nokhnaton"
        }
      + members {
          + role     = "member"
          + username = "ogu-kazemiya"
        }
      + members {
          + role     = "member"
          + username = "pippi0057"
        }
      + members {
          + role     = "member"
          + username = "reiroop"
        }
      + members {
          + role     = "member"
          + username = "shibutomo"
        }
      + members {
          + role     = "member"
          + username = "shushuya0210"
        }
      + members {
          + role     = "member"
          + username = "ynta-3"
        }
      + members {
          + role     = "member"
          + username = "yuhima03"
        }

        # (39 unchanged blocks hidden)
    }

Plan: 10 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>